# =============================================================================
# print('Hello World！')
# 
# num1 = 10       #這是數字一
# num2 = 10       #這是數字二
# total = num1 + num2   #這是數字一加二
# print(total)
# 
# 
# num1 = 145
# 
# num2 = 456
# 
# print('這是價格1：', num1, ',這是價格2：', num2)
# =============================================================================


# =============================================================================
# #設變數
# name = '金城武'
# price = 400
# goods = '衣服'
# 
# #OUTPUT：金今武花了400元，買了一件衣服
# 
# print(name, '花了',price, '元,買了一件', goods, sep='', end='\n')    #sep沒空格，end不換行，\n換行
# print(f'{name}花了{price}元,買了一件{goods}')
# =============================================================================



# =============================================================================
# #字串切片的概念
# 
# a='abdba'   #迴文，前後反轉看都一樣
# 
# myStr='Python'
# 
# print(myStr[2])
# print(myStr[-4])
# print(myStr[0:3:1])
# print(myStr[0:3:])
# print(myStr[:3:])
# print(myStr[-6:-3:])
# print(myStr[::-1])
# print(myStr[::2])
# =============================================================================


# =============================================================================
# age = input('請輸入年紀？')       #這裡是輸入字串
# print(f'你輸入的是{age}歲')
# 
# age = int(input('請輸入年紀？'))  #這裡轉換為數字
# print(30**2)
# =============================================================================

# =============================================================================
# age = int(input('請輸入年紀？'))  #這裡轉換為數字
# if age<int(18):
#     print(f'{age}歲未成年')
#     
# else: 
#     print(f'{age}歲已成年')
# =============================================================================


# =============================================================================
# #攝氏轉華氏
# c=float(input('請輸入攝氏度：'))
# fa = c*9/5 + 32
# print(f'您輸入的攝氏度轉換為華氏{fa}度')
# =============================================================================



# =============================================================================
# #攝華氏互轉
# mode = input('選擇模式：1=攝氏轉華氏，2=華氏轉攝氏')
# 
# if mode == '1':
#     c = float(input('請輸入攝氏度：'))
#     fa = c * 9/5 + 32
#     print(f'您輸入的攝氏{c}度轉換為華氏{fa}度')
# 
# if mode == '2':
#     fa = float(input('請輸入華氏度：'))
#     c = (fa-32) * 5/9
#     print(f'您輸入的華氏{fa}度轉換為攝氏{c}度')
# =============================================================================


# =============================================================================
# a = 5
# b = 8
# 
# print(a+b)
# print(a-b)
# print(a*b)
# print(a/b)
# print('-'*30)
# =============================================================================


# =============================================================================
# #複利計算
# #本金5萬，年利率1.5%，定存3年變多少錢？
# 
# money = 50000
# rate = 0.015
# 
# #第一年本利和
# y1 = money * (1+rate)
# print(y1)
# 
# #第二年本利和
# y2 = y1 * (1+rate)
# print(y2)
# 
# #第三年本利和
# y3 = y2 * (1+rate)
# print(y3)
# =============================================================================


# =============================================================================
# #複利計算(聰明一點點的寫法)
# ##本金5萬，年利率1.5%，定存3年變多少錢？
# 
# money = 50000
# rate = 0.015
# years = 3
# 
# amount = money
# for i in range(1, years + 1):
#     amount *= (1 + rate)
#     print(f'第{i}年本利和：{amount:.2f}')
# =============================================================================


# =============================================================================
# #串列
# scores = []     # 先準備一個空的清單
# 
# # 假設使用者輸入了三筆成績(這裡我們先直接寫進去)
# scores.append(80)
# scores.append(90)
# scores.append(75)
# print('目前的成績單：',scores)
# 
# # 算出總分與平均
# 
# total = sum(scores)     #總分
# avg = total / len(scores)       #總分除以人數 len代表長度，目前是3人，就是除以3
# print('總分是：', total)
# print(f'平均分數是：{avg:.2f}')
# =============================================================================


# =============================================================================
# # 初始背包
# backpack = ["水壺", "小刀", "過期罐頭", "手電筒"]
# print(f'初始背包：{backpack}')
# 
# # 1) 搜刮物資 (Append)：把 "散彈槍" 放到最後面
# backpack.append('散彈槍')
# print(f'撿到散彈槍後，背包裡的物品變成：{backpack}')
# 
# # 2) 緊急狀況 (Insert)：把 "解毒劑" 放到第一個位置(索引0)
# backpack.insert(0, "解毒劑")
# print(f'撿到解毒劑後，背包裡的物品變成：{backpack}')
# 
# # 3) 消耗物資 (Remove)：移除 "過期罐頭"
# backpack.remove("過期罐頭")
# print(f'肚子餓了，吃掉過期罐頭，背包裡的物品變成：{backpack}')
# 
# # 4) 整理裝備 (Sort)：排序(由小到大)
# backpack.sort(reverse=True)
# print(f'整理裝備後：{backpack}')
# 
# # 5) 生死關頭 (In / If)：檢查是否有 "散彈槍"
# if '散彈槍' in backpack:
#     print('劇情：找到背包裡的散彈槍，砰！殭屍被轟飛了，你活下來了！')
# else:
#     print('劇情：你變成了殭屍的午餐...')
# 
# # 6) 斷捨離 (Slicing)：只保留前 3 個物品
# backpack = backpack[:3:]
# print(f'整理最終背包：{backpack}')
# =============================================================================

# =============================================================================
# vocab={'apple':'蘋果'}
# 
# # =============================================================================
# # word=input('請輸入英文單字？')
# # =============================================================================
# 
# #vacob['key']
# #some code
# vocab['cat']='貓'
# 
# vocab['cat']='小貓咪'
# print(vocab)
# 
# # =============================================================================
# # meaning=vocab[word, '抱歉，我的字典裡沒有這個單字！']
# # print(f'中文為{meaning}')
# =============================================================================
# =============================================================================

# =============================================================================
# import builtins
# 
# #初始貨物
# cargo={
#        '能量電池':50,
#        '太空罐頭':100,
#        '修復零件':20
#        }
# 
# word=builtins.input('你在隕石帶撿到了？') # 例如輸入：反物質燃料
# qty=int(builtins.input('幾個？'))
# 
# # 1) 發現新物資：撿到 5 個「反物質燃料」（或你輸入的物資）
# cargo[word] = cargo.get(word, 0) + qty
# 
# print("目前貨物 cargo：", cargo)
# 
# # 2) 物資交易： 你停靠在空間站，賣出了 30 個「太空罐頭」，請更新背包中的數量。
# sell_item= builtins.input('你停靠在空間站，身上沒錢，要賣什麼東西換錢？')
# qty=int(builtins.input('幾個？'))
# 
# cargo[sell_item] -= qty
# print("目前貨物 cargo：", cargo)
# 
# # 3) 價格清單： 建立另一個字典 prices，記錄單價：能量電池 是 10 幣、太空罐頭 是 5 幣、修復零件 是 50 幣、反物質燃料 是 200 幣。
# price={
#        '能量電池':10,
#        '太空罐頭':5,
#        '修復零件':50
#        }
# 
# if word not in price:
#     price[word]=int(builtins.input(f'請輸入 {word} 的單價:'))
# 
# # 計算背包裡的總價(把cargo裡的每一樣都算一次)
# total=0 
# for item in cargo:
#     total=total + cargo[item] * price.get(item, 0)
#     
# print('價格清單 price:', price)
# print('背包總價值:', total, '星幣')
# =============================================================================

# =============================================================================
# # 1. 撿到一堆重複的寶物
# loot_bag = ["金幣", "紅寶石", "金幣", "木棍", "紅寶石", "小刀"]
# print("原本的清單:", loot_bag)
# 
# # 2. 轉換成集合 (魔法發生了！)
# #MAGIC_綵= {"金幣"}
# magic_set = set(loot_bag)
# 
# # 3. 看看結果
# print("神奇背包裡的寶物:", )
# =============================================================================

# =============================================================================
# print('====公司年度健檢系統====')
# SBP=int(input('請輸入您的收縮壓'))
# 
# if SBP > 140 :
#     print('提醒，您的收縮壓偏高，請列入自主健康管理並諮詢醫師')
# 
# print('[系統結束]')
# =============================================================================


# =============================================================================
# num = int(input('請輸入一個整數'))
# 
# if num % 2 :
#     print(f'{num}為奇數')
# else:
#     print(f'{num}為偶數')    
# =============================================================================
    
    



















