# -*- coding: utf-8 -*-
"""
Spyder Editor

This is a temporary script file.
"""

cargo = {
    "能量電池": 50,
    "太空罐頭": 100,
    "修復零件": 20
}

print('---星際貨船系統讀取中 ---')
# 1. 發現新物資
cargo["反物質燃料"] = 5
print(f"[系統更新] 發現新物資：反物質燃料 x {cargo['反物質燃料']}")

# 2. 物資交易
#cargo["太空罐頭"] = cargo["太空罐頭"]-30
cargo["太空罐頭"] -= 30
print(f"[交易成功] 賣出 30 個太空罐頭，目前剩餘 {cargo['太空罐頭']} 個。")


# 3. 建立價格字典
prices = {"能量電池": 10,"太空罐頭": 5,"修復零件": 50,"反物質燃料": 200}

print(f"📦 當前貨物清單：\n\
- 能量電池: {cargo['能量電池']} 個\n\
- 太空罐頭: {cargo['太空罐頭']} 個\n\
- 修復零件: {cargo['修復零件']} 個\n\
- 反物質燃料: {cargo['反物質燃料']} 個")

#tuple()元組,裡面的元素不可變
# =============================================================================
# a=cargo.values()
# print(a)
# =============================================================================

# 4. 計算總價值
#for 變數 in 可迭代的物件:
    #要執行的動作
total_value = 0
for item, count in cargo.items():
    value = count * prices[item]
    #total_value = total_value + value
    total_value += value

print(f"💰 目前船上的貨物總價值為：{total_value} 星幣")

# 5. 清空過期品
cargo['過期藥品']=10
if "過期藥品" in cargo:
    del cargo["過期藥品"]
    print("已清理過期藥品")
else:
    print("✅ 船艙檢查完畢，安全無虞！")
    
    
# =============================================================================
# # 1. 撿到一堆重複的寶物
# loot_bag = ["金幣", "紅寶石", "金幣", "木棍", "紅寶石", "小刀"]
# print("原本的清單：", loot_bag)
# 
# # 2. 轉換成集合 (魔法發生了！)
# #magic_set = {'金幣'}
# magic_set = set(loot_bag)
# 
# # 3. 看看結果
# print("神奇背包裡的寶物：", magic_set)
# 
# # 4. 計算種類
# print("寶物總共有幾種：", len(magic_set))
# =============================================================================
    






