# -*- coding: utf-8 -*-
"""
Created on Fri Feb  6 14:22:58 2026

@author: user
"""

# =============================================================================
# print('========公司年度健檢系統========')
# SBP=int(input('請輸入您的收縮壓? '))
# 
# if SBP > 140 :
#     print('提醒：您的收縮壓偏高，請列入自主健康管理並諮詢醫師')
#     
#     
# print('[系統結束]')
# =============================================================================


# =============================================================================
# num=int(input('請輸入一個整數?'))
# 
# if num % 2 :
#     print(f'{num}為奇數')
# else:
#     print(f'{num}為偶數')
# =============================================================================


# =============================================================================
# print('========面試資格初審系統========')
# 
# service_years = float(input('請輸入「工作年資」:'))
# 
# if service_years >= 2 :
#     print('[系統通知]符合面試資格')
# else:
#     print('[系統通知]資歷尚未達標，您的履歷已存入人才庫備查')
# =============================================================================
    
# =============================================================================
# 請撰寫程式輸入商品單價。單
# 價 5000 以上打 8 折；3000 以上打 9 折；其餘不打折。最後印出「折扣後單價」。
# =============================================================================
    
price = float(input('請輸入商品單價 : '))

if price > 5000 :
    rate = 0.8
elif price > 3000 :
    rate = 0.9
else:
    rate = 1
    
print(f'商品單價 : {price}')
print(f'折數為 : {rate}')
print(f'折扣後單價 : {price * rate :,.0f}')
    
    

